In [1]:
import pandas as pd

In [2]:
gdp = pd.read_csv('국가별_gdp.csv')

In [4]:
gdp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5049 entries, 0 to 5048
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   LOCATION               5049 non-null   object
 1   Country                5049 non-null   object
 2   TRANSACT               5049 non-null   object
 3   Transaction            5049 non-null   object
 4   MEASURE                5049 non-null   object
 5   Measure                5049 non-null   object
 6   TIME                   5049 non-null   int64
 7   Year                   5049 non-null   int64
 8   Unit Code              5049 non-null   object
 9   Unit                   5049 non-null   object
 10  PowerCode Code         5049 non-null   int64
 11  PowerCode              5049 non-null   object
 12  Reference Period Code  0 non-null      float64
 13  Reference Period       0 non-null      float64
 14  Value                  5049 non-null   float64
 15  Flag Codes             1291 non-null   object
 16  Flags                  1291 non-null   object
dtypes: float64(3), int64(3), object(11)
memory usage: 670.7+ KB

In [8]:
gdp = gdp[['Country', 'LOCATION', 'Year', 'Value']]
gdp

        Country LOCATION  Year         Value
0     Australia      AUS  1959  16613.000000
1     Australia      AUS  1960  17574.000000
2     Australia      AUS  1961  17788.000000
3     Australia      AUS  1962  19232.000000
4     Australia      AUS  1963  21251.000000
...         ...      ...   ...           ...
5044    Senegal      SEN  2016      6.356069
5045    Senegal      SEN  2017      7.407486
5046    Senegal      SEN  2018      6.209241
5047    Senegal      SEN  2019      4.613628
5048    Senegal      SEN  2020      1.325505

[5049 rows x 4 columns]

In [12]:
gdp.columns = ['국가명', '국가코드', '기준연도', 'gdp']

In [15]:
gdp.to_csv('국가별_gdp.csv', encoding='utf-8', index=False)